app/controllers/posts_controller.rb

	def create
    @topic = Topic.find(params[:topic_id])
    @post = @topic.posts.build(post_params)
    @post.user = current_user

    if @post.save
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "posts" ("title", "body", "topic_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "123"], ["body", "123"], ["topic_id", 4], ["created_at", "2017-10-30 19:59:29.673322"], ["updated_at", "2017-10-30 19:59:29.673322"]]

  def update
    @post = Post.find(params[:id])
    @post.assign_attributes(post_params)
    if @post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 1]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "Et mollitia unde sit magni. Ut culpa ut iusto. Quae id animi fugiat numquam ipsa. Omnis aut quos facilis mollitia et.333"], ["updated_at", "2017-10-29 08:46:23.601224"], ["id", 69]]

  def destroy
    @post = Post.find(params[:id])

    if @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 69]]