app/controllers/topics_controller.rb

  def create
    @topic = Topic.new
    @topic.name = params[:topic][:name]
    @topic.description = params[:topic][:description]
    @topic.public = params[:topic][:public]

    if @topic.save
---
INSERT INTO "topics" ("name", "description", "public", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "33"], ["description", "33"], ["public", "f"], ["created_at", "2017-10-30 20:00:28.168325"], ["updated_at", "2017-10-30 20:00:28.168325"]]

  def update
    @topic = Topic.find(params[:id])

    @topic.name =        params[:topic][:name]
    @topic.description = params[:topic][:description]
    @topic.public =      params[:topic][:public]

    if @topic.save
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "topics" SET "name" = ?, "description" = ?, "public" = ?, "updated_at" = ? WHERE "topics"."id" = ?